RWDItest/motorBike/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# copy motorbike surface from resources directory


runApplication blockMesh
runApplication snappyHexMesh -overwrite
cp system/decomposeParDict.hierarchical system/decomposeParDict
runApplication decomposePar -copyZero

cp system/decomposeParDict.ptscotch system/decomposeParDict
# runParallel snappyHexMesh -overwrite

find . -type f -iname "*level*" -exec rm {} \;

runParallel renumberMesh -overwrite

runParallel potentialFoam -initialiseUBCs

runParallel $(getApplication)

#------------------------------------------------------------------------------
